package com.ibs.ibspay.client.model;

public enum TransCode {
    TC01121990,  // 货物贸易	网络购物（报关）
    TC01122030,  // 货物贸易	未纳入海关统计的网络购物
    TC02223022,  // 留学	    留学及教育相关旅行（一年以上）学费
    TC02223023,  // 留学	    留学及教育相关旅行（一年及一年以下）学费
    TC03222024,  // 机票	    跨境机票款
    TC03223010,  // 机票	    公务及商务旅行机票
    TC03223021,  // 机票	    就医及健康相关旅行机票
    TC03223022,  // 机票	    留学及教育相关旅行（一年以上）机票
    TC03223023,  // 机票	    留学及教育相关旅行（一年以下）机票
    TC03223029,  // 机票	    其他私人旅行机票
    TC04223010,  // 酒店	    留学及教育相关旅行（一年以下）酒店
    TC04223021,  // 酒店	    其他私人旅行酒店
    TC04223022,  // 酒店	    公务及商务旅行酒店
    TC04223023,  // 酒店	    就医及健康相关旅行酒店
    TC04223029,  // 酒店	    留学及教育相关旅行（一年以上）酒店
    TC06223010,  // 旅游	    公务及商务旅行
    TC06223021,  // 旅游	    就医及健康相关旅行
    TC06223022,  // 旅游	    留学及教育相关旅行（一年以上）
    TC06223023,  // 旅游	    留学及教育相关旅行（一年及一年以下）
    TC06223029,  // 旅游	    其他私人旅行
}
