package com.ibs.pg.java.model;

public enum TransCode {
    TC_01121990,  // 货物贸易	网络购物（报关）
    TC_01122030,  // 货物贸易	未纳入海关统计的网络购物
    TC_02223022,  // 留学	    留学及教育相关旅行（一年以上）学费
    TC_02223023,  // 留学	    留学及教育相关旅行（一年及一年以下）学费
    TC_03222024,  // 机票	    跨境机票款
    TC_03223010,  // 机票	    公务及商务旅行机票
    TC_03223021,  // 机票	    就医及健康相关旅行机票
    TC_03223022,  // 机票	    留学及教育相关旅行（一年以上）机票
    TC_03223023,  // 机票	    留学及教育相关旅行（一年以下）机票
    TC_03223029,  // 机票	    其他私人旅行机票
    TC_04223010,  // 酒店	    留学及教育相关旅行（一年以下）酒店
    TC_04223021,  // 酒店	    其他私人旅行酒店
    TC_04223022,  // 酒店	    公务及商务旅行酒店
    TC_04223023,  // 酒店	    就医及健康相关旅行酒店
    TC_04223029,  // 酒店	    留学及教育相关旅行（一年以上）酒店
    TC_06223010,  // 旅游	    公务及商务旅行
    TC_06223021,  // 旅游	    就医及健康相关旅行
    TC_06223022,  // 旅游	    留学及教育相关旅行（一年以上）
    TC_06223023,  // 旅游	    留学及教育相关旅行（一年及一年以下）
    TC_06223029,  // 旅游	    其他私人旅行
}
